{"timestamp": "2025-06-29T18:51:31.725998", "query": "What does the quran say about love?", "results": [{"text": "4:529 AND WORSHIP God [alone], and do not ascribe divinity, in any way, to aught beside Him. And do good unto your parents, and near of kin, and unto orphans, and the needy, and the neighbour from among your own people, and the neighbour who is a stranger, and the friend by your side, and the wayfarer, and those whom you rightfully possess. Verily, God does not love any of those who, full of self-conceit, act in a boastful manner;", "source": "quran", "score": 0.9964368343353271, "category": "quran"}, {"text": "36:3707 Consider this Qur’an full of wisdom:", "source": "quran", "score": 0.993816077709198, "category": "quran"}, {"text": "17:2118 For, indeed, many facets have We given in this Qur'an to every kind of lesson [designed] for [the benefit of] mankind! However, most men are unwilling to accept anything but blasphemy", "source": "quran", "score": 0.9853647947311401, "category": "quran"}, {"text": "94:6098 and unto thy Sustainer turn with love.", "source": "quran", "score": 0.9297598004341125, "category": "quran"}, {"text": "19:2346 VERILY, those who attain to faith and do righteous deeds will the Most Gracious endow with love:", "source": "quran", "score": 0.8839749097824097, "category": "quran"}]}
{"timestamp": "2025-06-29T18:52:08.677123", "query": "Should I use a miswak", "results": [{"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, The example of a miser and a generous person is \n like that of two persons wearing iron cloaks from the breast upto the \n neck When the generous person spends, the iron cloak enlarges and \n spread over his skin so much so that it covers his fingertips and \n obliterates his tracks. As for the miser, as soon as he thinks of \n spending every ring of the iron cloak sticks to its place (against his\n body) and he tries to expand it, but it does not expand. The Prophet (ﷺ) \n pointed with his hand towards his throat.", "source": "hadith", "score": 1.3229409456253052, "category": "hadith"}, {"text": "Narrated Abu Huraira:Allah's Messenger (ﷺ) said, \"Were I not afraid that it would be hard on my followers, I would order them to \nuse the siwak (as obligatory, for cleaning the teeth).", "source": "hadith", "score": 1.1694836616516113, "category": "hadith"}, {"text": "Narrated Anas:Allah's Messenger (ﷺ) said, \"I have told you repeatedly to use the Siwak. (The Prophet (ﷺ) put emphasis on the use of the Siwak.)", "source": "hadith", "score": 1.0840736627578735, "category": "hadith"}, {"text": "Question: Is it ok in Islam that I give Dawah to people to do halal things but by myself, I do the opposite. Can I still get the reward? Answer:\n\n You will be greatly rewarded for inviting towards good. However, you will alsobe accountable for not fulfilling the necessary injunctions of Shari'ah. And Allah Ta'ala Knows Best Mufti Ebrahim Desai FATWA DEPT.", "source": "fatwa", "score": 1.355708360671997, "category": "fatwa"}, {"text": "Question: 1:Duaa coming up from RUKU before going into soedjood. Can we make our own prayer after saying \"RAB-BA-NAA WA-LA-KAL HAMD\", not neccessarily qunoot ?2:Fancy musallahs distracting Answer:\n\n (1) : From hadeeth, I read that the Nabee(SAWS), sometimes made duaa asking for ALLAH hu ta-alla, to forgive people he mentioned by name. Can we do the same, when we feel the need for it ? (2) : should we buy the musallahs that have nice and fancy artwork of the kaba, and holy mosques, on it. It is said that it is prefered to salaah open eyes, and that ones eyes be set on where one's head is going to be placed. These fancy musallahs is very distracting. ANSWER \n\n 1. One should firstly recite the Qunoot. Thereafter, if one wishes to make further Du?aa, one may do so. The Du?aa has to be in Arabic. 2. We agree with you. It is best to have plain and simple Musallahs that do not distract a person. and Allah Ta'ala Knows Best Moulana Imraan Vawda FATWA DEPT.", "source": "fatwa", "score": 1.355547308921814, "category": "fatwa"}]}
